fix diagrams
